src/poisson-and-exp-distribution.org
#+title: 泊松分布和指数分布的关系

参考链接
- [[https://www.ruanyifeng.com/blog/2015/06/poisson-distribution.html][泊松分布和指数分布：10分钟教程 - 阮一峰的网络日志]]
- [[https://blog.codingnow.com/2007/09/poisson_distribution.html][云风的 BLOG: 泊松分布]]
- [[https://zh.wikipedia.org/wiki/%E6%B3%8A%E6%9D%BE%E5%88%86%E4%BD%88][泊松分佈 - 维基百科，自由的百科全书]]
- [[https://zh.wikipedia.org/wiki/%E6%8C%87%E6%95%B0%E5%88%86%E5%B8%83][指数分布 - 维基百科，自由的百科全书]]

我觉得两者之间是存在联系的，指数分布可以通过泊松分布推导出来，所以先从泊松分布入手。

-----

#+BEGIN_QUOTE
泊松分布适合于描述单位时间内随机事件发生的次数的概率分布。如某一服务设施在一定时间内受到的服务请求的次数，电话交换机接到呼叫的次数、汽车站台的候客人数、机器出现的故障数、自然灾害发生的次数、DNA序列的变异数、放射性原子核的衰变数、雷射的光子數分布等等。
#+END_QUOTE

泊松分布是基于二项式伯努利实推导出来的：
- 单位时间内平均产生lam个事件
- 然后将单时间轴切换成为n个小片，每个小片内发生一次的概率是p'=lam/n (这是一个假设)
- 那么在单位时间内，发生k次事件的概率是 C(n,k) * p'^k * (1-p')^(n-k). （二项式伯努利实验）
- 当n->inf的时候，我们就得到了泊松分布

-----

泊松分布的pmf是 P(x=k) = e^(-lam) * lam ^ k / k! 其中lam是单位时间内平均发生次数。基于这个pmf我们可以推导出指数分布的cdf F(x=t)

#+BEGIN_QUOTE
指數分布可以用来表示獨立隨機事件發生的時間間隔，比如旅客進入機場的時間間隔、打進客服中心電話的時間間隔、中文維基百科新條目出現的時間間隔等等。
#+END_QUOTE

F(x=t)表示两个事件间隔<=t个单位时间的概率，也就是1-P(t个单位时间内没有产生任何事件).

P(t个单位时间内没有任何事件) = P(x=0) ** t = e^(-lam * t), 所以F(x=t) = 1-e^(-lam * t).

有了cdf就比较容易得到pmf, 就是求导。指数分布的pmf P(x=t) = t*e^(-lam *t).

这里lam还是保持原有的含义，就是单位时间内平均发生次数。

-----

我觉得这两个分布就是一个事情的两个视角，泊松分布从单位时间内产生次数去考虑，而指数分布从两次事件的间隔去考虑。
两种方式去建模都是可行的，但是某一种可能会更加适合某一类问题，比如这个问题 [[file:poission-distribution-in-bitcoin-mining.org][比特币挖矿的泊松分布问题(指数分布)]]
这个问题更加关心的是时间间隔，所以指数分布比泊松分布要更好。
