html/poisson-and-exp-distribution.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>泊松分布和指数分布的关系</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="dirtysalt" />
<link rel="shortcut icon" href="/themes/favicon.ico" /><link rel="stylesheet" type="text/css" href="/themes/simple.css"/></head>
<body>
<div id="content">
<h1 class="title">泊松分布和指数分布的关系</h1>
<p>
参考链接
</p>
<ul class="org-ul">
<li><a href="https://www.ruanyifeng.com/blog/2015/06/poisson-distribution.html">泊松分布和指数分布：10分钟教程 - 阮一峰的网络日志</a>
</li>
<li><a href="https://blog.codingnow.com/2007/09/poisson_distribution.html">云风的 BLOG: 泊松分布</a>
</li>
<li><a href="https://zh.wikipedia.org/wiki/%E6%B3%8A%E6%9D%BE%E5%88%86%E4%BD%88">泊松分佈 - 维基百科，自由的百科全书</a>
</li>
<li><a href="https://zh.wikipedia.org/wiki/%E6%8C%87%E6%95%B0%E5%88%86%E5%B8%83">指数分布 - 维基百科，自由的百科全书</a>
</li>
</ul>

<p>
我觉得两者之间是存在联系的，指数分布可以通过泊松分布推导出来，所以先从泊松分布入手。
</p>

<hr  />

<blockquote>
<p>
泊松分布适合于描述单位时间内随机事件发生的次数的概率分布。如某一服务设施在一定时间内受到的服务请求的次数，电话交换机接到呼叫的次数、汽车站台的候客人数、机器出现的故障数、自然灾害发生的次数、DNA序列的变异数、放射性原子核的衰变数、雷射的光子數分布等等。
</p>
</blockquote>

<p>
泊松分布是基于二项式伯努利实推导出来的：
</p>
<ul class="org-ul">
<li>单位时间内平均产生lam个事件
</li>
<li>然后将单时间轴切换成为n个小片，每个小片内发生一次的概率是p'=lam/n (这是一个假设)
</li>
<li>那么在单位时间内，发生k次事件的概率是 C(n,k) * p'^k * (1-p')^(n-k). （二项式伯努利实验）
</li>
<li>当n-&gt;inf的时候，我们就得到了泊松分布
</li>
</ul>

<hr  />

<p>
泊松分布的pmf是 P(x=k) = e^(-lam) * lam ^ k / k! 其中lam是单位时间内平均发生次数。基于这个pmf我们可以推导出指数分布的cdf F(x=t)
</p>

<blockquote>
<p>
指數分布可以用来表示獨立隨機事件發生的時間間隔，比如旅客進入機場的時間間隔、打進客服中心電話的時間間隔、中文維基百科新條目出現的時間間隔等等。
</p>
</blockquote>

<p>
F(x=t)表示两个事件间隔&lt;=t个单位时间的概率，也就是1-P(t个单位时间内没有产生任何事件).
</p>

<p>
P(t个单位时间内没有任何事件) = P(x=0) ** t = e^(-lam * t), 所以F(x=t) = 1-e^(-lam * t).
</p>

<p>
有了cdf就比较容易得到pmf, 就是求导。指数分布的pmf P(x=t) = t*e^(-lam *t).
</p>

<p>
这里lam还是保持原有的含义，就是单位时间内平均发生次数。
</p>

<hr  />

<p>
我觉得这两个分布就是一个事情的两个视角，泊松分布从单位时间内产生次数去考虑，而指数分布从两次事件的间隔去考虑。
两种方式去建模都是可行的，但是某一种可能会更加适合某一类问题，比如这个问题 <a href="poission-distribution-in-bitcoin-mining.html">比特币挖矿的泊松分布问题(指数分布)</a>
这个问题更加关心的是时间间隔，所以指数分布比泊松分布要更好。
</p>
</div>
</body>
</html>
